In [1]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
!pip install ipython-sql

Requirement already satisfied: sqlalchemy==1.3.9 in /home/garner/anaconda3/lib/python3.8/site-packages (1.3.9)
Requirement already satisfied: ibm_db_sa in /home/garner/anaconda3/lib/python3.8/site-packages (0.3.7)
Requirement already satisfied: sqlalchemy>=0.7.3 in /home/garner/anaconda3/lib/python3.8/site-packages (from ibm_db_sa) (1.3.9)
Requirement already satisfied: ibm-db>=2.0.0 in /home/garner/anaconda3/lib/python3.8/site-packages (from ibm_db_sa) (3.0.4)
Requirement already satisfied: ipython-sql in /home/garner/anaconda3/lib/python3.8/site-packages (0.3.9)
Requirement already satisfied: six in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: prettytable in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython-sql) (2.0.0)
Requirement already satisfied: sqlparse in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: sqlalchemy>=0.6.7 in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython-sql) (1.3.9)
Requirement already satisfied: ipython-genutils>=0.1.0 in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython-sql) (7.16.1)
Requirement already satisfied: wcwidth in /home/garner/anaconda3/lib/python3.8/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: setuptools in /home/garner/anaconda3/lib/python3.8/site-packages (from prettytable->ipython-sql) (49.2.0.post20200714)
Requirement already satisfied: traitlets>=4.2 in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: pickleshare in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: pygments in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: jedi>=0.10 in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: backcall in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pexpect; sys_platform != "win32" in /home/garner/anaconda3/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in /home/garner/anaconda3/lib/python3.8/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: ptyprocess>=0.5 in /home/garner/anaconda3/lib/python3.8/site-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)

In [2]:
%load_ext sql

In [3]:
import pandas as pd
import sqlite3

In [5]:
df = pd.read_csv('Spacex.csv')

In [6]:
df['Date'] = pd.to_datetime(df['Date'],infer_datetime_format=True)

In [7]:
df.rename(columns={'Landing _Outcome':'Landing_Outcome'}, inplace=True)

In [8]:
df.head()

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-04-06,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-08-12,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,07:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-08-10,00:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-01-03,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

In [9]:
df.shape

(101, 10)

In [10]:
conn = sqlite3.connect("Any_Database_Name.db") 
df.to_sql('Some_Table_Name', conn, if_exists='replace')
sql_string = 'SELECT * FROM Some_Table_Name'
df = pd.read_sql(sql_string, conn)

/home/garner/anaconda3/lib/python3.8/site-packages/pandas/core/generic.py:2653: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [11]:
sql_string = 'SELECT DISTINCT Launch_Site FROM Some_Table_Name'
df = pd.read_sql(sql_string, conn)
df

    Launch_Site
0   CCAFS LC-40
1   VAFB SLC-4E
2    KSC LC-39A
3  CCAFS SLC-40

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [12]:
sql_string = "SELECT * FROM Some_Table_Name WHERE Launch_Site LIKE 'CCA%' LIMIT 5"
df = pd.read_sql(sql_string, conn)
df

,index,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,0,2010-04-06 00:00:00,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,1,2010-08-12 00:00:00,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2,2012-05-22 00:00:00,07:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,3,2012-08-10 00:00:00,00:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,4,2013-01-03 00:00:00,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [13]:
sql_string = "SELECT SUM(PAYLOAD_MASS__KG_) FROM Some_Table_Name WHERE Payload LIKE '%CRS%'"
df = pd.read_sql(sql_string, conn)
df

   SUM(PAYLOAD_MASS__KG_)
0                  111268

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [14]:
sql_string = "SELECT AVG(PAYLOAD_MASS__KG_) FROM Some_Table_Name WHERE Booster_Version LIKE '%F9 v1.1%'"
df = pd.read_sql(sql_string, conn)
df

   AVG(PAYLOAD_MASS__KG_)
0             2534.666667

### Task 5

##### List the date when the first successful landing outcome in ground pad was acheived.

In [15]:
sql_string = "SELECT MIN(Date) FROM Some_Table_Name"
df = pd.read_sql(sql_string, conn)
df

             MIN(Date)
0  2010-04-06 00:00:00

In [16]:
sql_string = "SELECT MIN(Date) FROM Some_Table_Name WHERE Landing_Outcome='Success (ground pad)'"
df = pd.read_sql(sql_string, conn)
df

             MIN(Date)
0  2015-12-22 00:00:00

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [17]:
sql_string = "SELECT DISTINCT Booster_Version FROM Some_Table_Name WHERE Landing_Outcome='Success (drone ship)' AND PAYLOAD_MASS__KG_>4000 AND PAYLOAD_MASS__KG_<6000"
df = pd.read_sql(sql_string, conn)
df

  Booster_Version
0     F9 FT B1022
1     F9 FT B1026
2  F9 FT  B1021.2
3  F9 FT  B1031.2

### Task 7

##### List the total number of successful and failure mission outcomes

In [18]:
sql_string = "SELECT COUNT(*) FROM Some_Table_Name WHERE Mission_Outcome LIKE 'F%'"
df = pd.read_sql(sql_string, conn)
df

   COUNT(*)
0         1

In [19]:
sql_string = "SELECT COUNT(*) FROM Some_Table_Name WHERE Mission_Outcome LIKE 'S%'"
df = pd.read_sql(sql_string, conn)
df

   COUNT(*)
0       100

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [20]:
sql_string = "SELECT MAX(PAYLOAD_MASS__KG_) FROM Some_Table_Name"
df = pd.read_sql(sql_string, conn)
df

   MAX(PAYLOAD_MASS__KG_)
0                   15600

In [21]:
sql_string = "SELECT DISTINCT Booster_Version FROM Some_Table_Name WHERE PAYLOAD_MASS__KG_=15600"
df = pd.read_sql(sql_string, conn)
df

   Booster_Version
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9

##### List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015

In [22]:
sql_string = "SELECT Landing_Outcome, Booster_Version, Launch_Site FROM Some_Table_Name WHERE Date LIKE '%2015%'"
df = pd.read_sql(sql_string, conn)
df

          Landing_Outcome Booster_Version  Launch_Site
0    Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1      Controlled (ocean)   F9 v1.1 B1013  CCAFS LC-40
2              No attempt   F9 v1.1 B1014  CCAFS LC-40
3    Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40
4              No attempt   F9 v1.1 B1016  CCAFS LC-40
5  Precluded (drone ship)   F9 v1.1 B1018  CCAFS LC-40
6    Success (ground pad)     F9 FT B1019  CCAFS LC-40

In [23]:
sql_string = "SELECT Landing_Outcome, Booster_Version, Launch_Site FROM Some_Table_Name WHERE Landing_Outcome='Failure (drone ship)'"
df = pd.read_sql(sql_string, conn)
df

        Landing_Outcome Booster_Version  Launch_Site
0  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40
2  Failure (drone ship)   F9 v1.1 B1017  VAFB SLC-4E
3  Failure (drone ship)     F9 FT B1020  CCAFS LC-40
4  Failure (drone ship)     F9 FT B1024  CCAFS LC-40

In [24]:
sql_string = "SELECT Landing_Outcome, Booster_Version, Launch_Site FROM Some_Table_Name WHERE Landing_Outcome='Failure (drone ship)' AND Date LIKE '%2015%'"
df = pd.read_sql(sql_string, conn)
df

        Landing_Outcome Booster_Version  Launch_Site
0  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40

### Task 10

##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

In [25]:
sql_string = "SELECT COUNT(DISTINCT Landing_Outcome) FROM Some_Table_Name "
df = pd.read_sql(sql_string, conn)
df

   COUNT(DISTINCT Landing_Outcome)
0                               11

In [26]:
sql_string = "SELECT DISTINCT Landing_Outcome FROM Some_Table_Name WHERE (SELECT COUNT(DISTINCT Landing_Outcome) FROM Some_Table_Name)"
df = pd.read_sql(sql_string, conn)
df

           Landing_Outcome
0      Failure (parachute)
1               No attempt
2     Uncontrolled (ocean)
3       Controlled (ocean)
4     Failure (drone ship)
5   Precluded (drone ship)
6     Success (ground pad)
7     Success (drone ship)
8                  Success
9                  Failure
10             No attempt

In [27]:
sql_string = "SELECT COUNT(DISTINCT Landing_Outcome) FROM Some_Table_Name WHERE Date BETWEEN '2010-06-04 00:00:00' AND '2017-03-20 00:00:00'"
df = pd.read_sql(sql_string, conn)
df

   COUNT(DISTINCT Landing_Outcome)
0                                8

In [28]:
sql_string = "SELECT * FROM Some_Table_Name WHERE Date BETWEEN 04-06-2010 AND 20-03-2017"
df = pd.read_sql(sql_string, conn)
df

Empty DataFrame
Columns: [index, Date, Time (UTC), Booster_Version, Launch_Site, Payload, PAYLOAD_MASS__KG_, Orbit, Customer, Mission_Outcome, Landing_Outcome]
Index: []